package homework.lesson10.task3;

public class Text {


    private String text = "14-й виток:\n" +
            "Рубин: - «Заря», «Заря», я «Рубин». 3 часа 48 минут. В правом иллюминаторе\n" +
            "вижу нераскрывшуюся солнечную батарею...\n" +
            "Заря: - Вас понял, прием...\n" +
            "Рубин: - Вижу землю, не покрытую облаками, горизонт... Солнечная батарея\n" +
            "направлена тыльной стороной в сторону солнца.\n" +
            "(Комаров уже понял - программу полета выполнить не удастся. Он даже\n" +
            "стучал ногой по стенке корабля в том месте, где крепится батарея.\n" +
            "Может, замок раскроется? Увы...)\n" +
            "16-й виток:\n" +
            "Рубин: - «Заря-3», я «Рубин». Перенес всю аппаратуру сюда, в корабль...\n" +
            "Люк-лаз закрыт. На борту порядок, как говорят. Параметры кабины\n" +
            "следующие: давление 800, температура 17,5.\n" +
            "Заря: - Готовьтесь к заключительным операциям. Все идет нормально, все\n" +
            "спокойно...\n" +
            "Рубин: - «Заря», я «Рубин». Вас понял. На 17-м автоматический спуск с\n" +
            "ионной ориентацией...\n" +
            "(Спускать корабль решили на 17-м витке, все-таки надеясь на ионную\n" +
            "ориентацию. На командном пункте вторые сутки люди без сна.\n" +
            "Вырабатывают новые инструкции для космонавта.)\n" +
            "Заря: - «Рубин», все команды к вам на борт прошли нормально.\n" +
            "Рубин: - Понял.\n" +
            "Кедр: - Ждем тебя на Земле, дорогой. «Кедр».\n" +
            "(В разговор включается дублер Комарова Юрий Гагарин. Это его позывной\n" +
            "«Кедр».)\n" +
            "Рубин: - До встречи!\n" +
            "Заря: - Даем сверку времени.\n" +
            "(Звучат сигналы «пип-пип-пип».)\n" +
            "Рубин: - Поправка по времени минус одна секунда.\n" +
            "Кедр: - Отлично. Тебе повезло с часами. Хорошие поставили. Не забудь как\n" +
            "следует поплотнее привязаться-пристегнуться перед входом в плотные...\n" +
            "Рубин: - Из оборудования научного я только хронограф взял...\n" +
            "Кедр: - На память его привезешь... Тут товарищи передают тебе\n" +
            "горячий-горячий привет, самые добрые пожелания мягкой, хорошей посадки.\n" +
            "Рубин: - Большое спасибо. Осталось до встречи немного, скоро увидимся.\n" +
            "Желаю вам успехов во всем.\n" +
            "(Но на 17-м витке корабль правильно сориентировать не получается. Отбой\n" +
            "спуска! До полного опустошения энергозапасов остается часа три.\n" +
            "Подготовить спуск на 18-м витке «земля» не успевает... )\n" +
            "18-й виток:\n" +
            "Заря: - Я «Заря-10». Даю данные ручного спуска. Виток 19-й.\n" +
            "Баллистический. Не спеши. Уточняй ориентацию потихоньку. Все должно\n" +
            "быть нормально.\n" +
            "(У космонавта остается одна надежда вернуться на Землю - вручную\n" +
            "сориентировать корабль. Спуск будет более крутым, перегрузки - более\n" +
            "сильными. На такой вариант космонавтов даже не тренировали...)\n" +
            "Рубин: - Я все прекрасно понял. Знаю, как быть. Все будет нормально. Я\n" +
            "«Рубин», не слышу вас...\n" +
            "Двадцатый: - «Рубин», я «Заря». Здесь повреждения в наземном канале\n" +
            "связи...\n" +
            "(В разговор включается Василий Мишин. Он назначен главным\n" +
            "конструктором после смерти Королева. Его позывной «двадцатый».)\n" +
            "Рубин: - «Двадцатый», вас прекрасно понял. Я не беспокоюсь, не волнуюсь.\n" +
            "Буду работать согласно программе...\n" +
            "Двадцатый - «Рубин», как самочувствие, как настроение?\n" +
            "Рубин: - Самочувствие отличное. Настроение хорошее. Система\n" +
            "жизнеобеспечения работала прекрасно.\n" +
            "Двадцатый - Очень рад. Мы все уверены, что у вас все будет хорошо.\n" +
            "Работайте спокойно. При спуске попробуйте вести репортаж. Может быть,\n" +
            "тут будет что-то слышно.\n" +
            "Рубин: - Я «Рубин». Через минуту включаю ориентацию.\n" +
            "Двадцатый - Понял. Связь с вами кончаем, не будем мешать вашей работе.\n" +
            "Давай, работай...\n" +
            "Рубин: - Я беспокоюсь, хватит ли времени на ориентацию...\n" +
            "19-й виток:\n" +
            "(Последние минуты на орбите. )\n" +
            "Заря: - «Рубин», я «Заря-10». Вызываю на связь...\n" +
            "Рубин: - Двигатель работал 146 секунд. Нормально все идет. Все идет\n" +
            "нормально! Корабль был сориентирован правильно.\n" +
            "(В голосе Комарова слышатся радостные нотки.) Нахожусь в среднем кресле.\n" +
            "Привязался ремнями.\n" +
            "Заря: - Как самочувствие?\n" +
            "Рубин: - Самочувствие отличное. Все в порядке.\n" +
            "Заря: - Вот тут товарищи рекомендуют дышать глубже. Ждем на\n" +
            "приземлении...\n" +
            "Рубин: - Спасибо. Передайте всем. Произошло раз... (Имеется в виду\n" +
            "разделение отсеков корабля. «Союз» входит в плотные слои атмосферы).\n" +
            "(На этом голос Комарова обрывается.)\n" +
            "(Слышно, как на командном пункте операторы, сменяя друг друга, пытаются\n" +
            "снова наладить связь с кораблем)\n" +
            "Заря: - «Рубин», я «Заря». Мы вас не слышим. Как слышите нас? Прием...\n" +
            "Заря: - Прием...\n" +
            "Заря: - Прием...\n" +
            "Заря: - Прием... ";

    public Text() {
        this.text = text;
    }

    public String getText() {
        return text;
    }

    public void setText(String text) {
        this.text = text;
    }
}
